Repository: backdrop-contrib/potx
Catalog: po/*.po
Languages: el

source: Helps to extract pot-files for translations from the sources of installed modules.
el: Βοηθά στην εξαγωγή αρχείων pot για τις μεταφράσεις από τον πηγαίο κώδικα των εγκατεστημένων μονάδων.

source: This page allows you to generate translation templates for module files. Select the module you wish to generate a template file for. A single Gettext Portable Object Template file is generated (unlike the output of the command line extractor utility), so you can easily save it and start translation.
el: Η σελίδα αυτή σας επιτρέπει να δημιουργήσετε αρχεία-πρότυπα μεταφράσεων για τα αρχεία των μονάδων. Επιλέξτε τη μονάδα για την οποίο θέλετε να δημιουργήσετε το αρχείο-πρότυπο. Ένα μοναδικό αρχείο Gettext Portable Object Template δημιουργείται (σε αντίθεση με την έξοδο από το εργαλείο εξαγωγής της γραμμής εντολών), ώστε να μπορείτε να το αποθηκεύσετε και να ξεκινήσετε τη μετάφραση.

source: Extract strings
el: Εξαγωγή συμβολοσειρών

source: Extract
el: Εξαγωγή

source: Extract from %module_name module, in directory %dir_name
el: Εξαγωγή από τη μονάδα %module_name, στον κατάλογο %dir_name

source: Generates output from all files found in this directory.
el: Δημιουργεί έξοδο από όλα τα αρχεία που υπάρχουν στον κατάλογο.

source: Extract from all modules in directory "@dir_name"
el: Εξαγωγή από όλες τις μονάδες στον κατάλογο "@dir_name"

source: To extract from a single module in this directory, choose the module entry in the fieldset below.
el: Για την εξαγωγή από μία μόνο μονάδα σε αυτό τον κατάλογο, επιλέξτε το όνομα της μονάδας στο πεδίο παρακάτω.

source: Modules in "@dir_name"
el: Μονάδες στον κατάλογο "@dir_name"

source: Extract from module %module_name
el: Εξαγωγή από τη μονάδα %module_name

source: Extract from files named %module_pattern, in directory %module_dir.
el: Εξαγωγή από αρχεία με ονόματα %module_pattern, στον κατάλογο %module_dir.

source: POT extractor
el: Εξαγωγέας POT

source: Provides a web interface to extract Gettext templates from the sources of installed modules.
el: Παρέχει μια διεπαφή ιστοσελίδας για την εξαγωγή προτύπων Gettext από τον πηγαίο κώδικα των εγκατεστημένων μονάδων.
